CSI API ETABS v1
cAnalyze.SetActiveDOF Method
 Sets the model global degrees of freedom.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetActiveDOF(
	ref bool[] DOF
)
Function SetActiveDOF (
	ByRef DOF As Boolean()
) As Integer
Dim instance As cAnalyze
Dim DOF As Boolean()
Dim returnValue As Integer
returnValue = instance.SetActiveDOF(DOF)
int SetActiveDOF(
	array<bool>^% DOF
)
abstract SetActiveDOF :
        DOF : bool[] byref -> int
Parameters
DOF
Type: System.Boolean[]
Return Value
Type: Int32
 Returns zero if the degrees of freedom are successfully set; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim DOF() As Boolean
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'set model degrees of freedom
       ReDim DOF(5)
       DOF(0) = True
       DOF(1) = True
       DOF(2) = True
       ret = SapModel.Analyze.SetActiveDOF(DOF)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cAnalyze Interface
ETABSv1 Namespace